SaerTrial/Ext-fuzzware/emulator/harness/fuzzware_harness/native/core_peripherals/mips/pic32mx_nvic.c
#include "pic32mx_nvic.h"

#define PIC32MX_NVIC_NONE_ACTIVE -1
#define PIC32MX_NVIC_LOWEST_PRIO -1
#define PIC32MX_NVIC_HIGHEST_PRIO 7
#define PIC32MX_NVIC_HIGHEST_SUB_PRIO 3
#define PIC32MX_NVIC_LOWEST_SUB_PRIO 0
// #define DEBUG_NVIC

// We may not want to allow nested interrupts
#define DISABLE_NESTED_INTERRUPTS


uint32_t pic32mx_interrupt_limit = 0;
uint32_t pic32mx_num_config_disabled_interrupts = 0;
uint32_t *pic32mx_config_disabled_interrupts = NULL;
uc_hook pic32mx_nvic_block_hook_handle = -1, pic32mx_nvic_exception_return_hook_handle=-1,
    pic32mx_hook_mmio_write_handle = -1, pic32mx_hook_mmio_read_handle = -1;
uint32_t pic32mx_nesting_detector = 0;

// 3. Dynamic State (required for state restore)
struct Pic32mxNVIC pic32mx_nvic __attribute__ ((aligned (64))) = {
    .vtor = PIC32MX_EBASE, // an idle assignment, we don't need this actually
    .num_enabled = 0
};

// forward declaration
static bool pic32mx_recalc_prios();
static void pic32mx_ExceptionEntry(uc_engine *uc);
bool pic32mx_is_disabled_by_config(int exception_no);
static void pic32mx_core_software_interrupt_controller(uc_engine *uc);
void pic32mx_update_enabled_irq_list(int irq);


__attribute__ ((hot))
static void pic32mx_nvic_block_hook(uc_engine *uc, uint64_t address, uint32_t size, struct Pic32mxNVIC* arg_nvic) {
        

        #ifdef DISABLE_NESTED_INTERRUPTS
            // Hack: prevent nested interrupt from happening
            if (pic32mx_nesting_detector == 1){
                if ((uint32_t)address == arg_nvic->EPC){
                    pic32mx_nesting_detector = 0;
                }else{
                    return;
                }
            }
        #endif
        

            pic32mx_core_software_interrupt_controller(uc);
            #ifdef DISABLE_NESTED_INTERRUPTS
            if( arg_nvic->active_irq == PIC32MX_NVIC_NONE_ACTIVE ) {
            #endif
                pic32mx_ExceptionEntry(uc);
            #ifdef DISABLE_NESTED_INTERRUPTS
            }
            #endif
}


static void pic32mx_core_software_interrupt_controller(uc_engine *uc){
    PIC32MX_CP0_cause CP0_cause;
    uc_reg_read(uc, UC_MIPS_REG_CP0_CAUSE, &CP0_cause);
    // core software interrupt 0
    if (CP0_cause.IP0){
        // Caution: only execute once
        if (pic32mx_nvic.InterruptEnabled[PIC32MX_IRQ_Core_Software_Interrupt_0] == 0){
            pic32mx_nvic.InterruptEnabled[PIC32MX_IRQ_Core_Software_Interrupt_0] = 1;
            pic32mx_nvic.InterruptPriority[PIC32MX_IRQ_Core_Software_Interrupt_0] = PIC32MX_NVIC_HIGHEST_PRIO;
            pic32mx_nvic.InterruptSubPriority[PIC32MX_IRQ_Core_Software_Interrupt_0] = PIC32MX_NVIC_HIGHEST_SUB_PRIO;
            pic32mx_update_enabled_irq_list(PIC32MX_IRQ_Core_Software_Interrupt_0);
        }
        pic32mx_nvic.InterruptPending[PIC32MX_IRQ_Core_Software_Interrupt_0] = 1;
        pic32mx_recalc_prios();
    }else{
            // In general cases, ISR code will clear pending bit via a MMIO write to the interrupt controller
            // then this handling is redundant
            #ifdef DEBUG_NVIC
            if (pic32mx_nvic.InterruptPending[PIC32MX_IRQ_Core_Software_Interrupt_0] == 1){
                printf("[core_software_interrupt_controller] unpending irq 1\n");
                fflush(stdout);
            }
            #endif


        pic32mx_nvic.InterruptPending[PIC32MX_IRQ_Core_Software_Interrupt_0] = 0;
    }

    // core software interrupt 1
    if (CP0_cause.IP1){
        if (pic32mx_nvic.InterruptEnabled[PIC32MX_IRQ_Core_Software_Interrupt_1] == 0){
            pic32mx_nvic.InterruptEnabled[PIC32MX_IRQ_Core_Software_Interrupt_1] = 1;
            pic32mx_nvic.InterruptPriority[PIC32MX_IRQ_Core_Software_Interrupt_1] = PIC32MX_NVIC_HIGHEST_PRIO;
            pic32mx_nvic.InterruptSubPriority[PIC32MX_IRQ_Core_Software_Interrupt_1] = PIC32MX_NVIC_HIGHEST_SUB_PRIO-1;
            pic32mx_update_enabled_irq_list(PIC32MX_IRQ_Core_Software_Interrupt_1);
        }
        pic32mx_nvic.InterruptPending[PIC32MX_IRQ_Core_Software_Interrupt_1] = 1;
    }else{
            #ifdef DEBUG_NVIC
            if (pic32mx_nvic.InterruptPending[PIC32MX_IRQ_Core_Software_Interrupt_1] == 1){
                printf("[core_software_interrupt_controller] unpending irq 2\n");
                fflush(stdout);
            }
            #endif

        pic32mx_nvic.InterruptPending[PIC32MX_IRQ_Core_Software_Interrupt_1] = 0;
    }

    // core timer interrupt 0
    if (CP0_cause.TI){
        if (pic32mx_nvic.InterruptEnabled[PIC32MX_IRQ_Core_Timer] == 0){
            pic32mx_nvic.InterruptEnabled[PIC32MX_IRQ_Core_Timer] = 1;
            pic32mx_nvic.InterruptPriority[PIC32MX_IRQ_Core_Timer] = PIC32MX_NVIC_HIGHEST_PRIO;
            pic32mx_nvic.InterruptSubPriority[PIC32MX_IRQ_Core_Timer] = PIC32MX_NVIC_HIGHEST_SUB_PRIO-1;
            pic32mx_update_enabled_irq_list(PIC32MX_IRQ_Core_Timer);
        }
        pic32mx_nvic.InterruptPending[PIC32MX_IRQ_Core_Timer] = 1;
    }else{
            #ifdef DEBUG_NVIC
            if (pic32mx_nvic.InterruptPending[PIC32MX_IRQ_Core_Timer] == 1){
                printf("[core timer interrupt] unpending irq 0\n");
                fflush(stdout);
            }
            #endif

        pic32mx_nvic.InterruptPending[PIC32MX_IRQ_Core_Timer] = 0;
    }
    

}

// Hack: we update status here by a given IRQ 
// because MMIO accesses don't indicate an IRQ
void pic32mx_pend_interrupt(uc_engine *uc, int exception_no) {
    #ifdef DEBUG_NVIC
    printf("[pend_interrupt] irq=%d, active_irq=%d\n", exception_no, pic32mx_nvic.active_irq);
    fflush(stdout);
    #endif
    if(pic32mx_nvic.InterruptPending[exception_no] == 0) {
        pic32mx_nvic.InterruptPending[exception_no] = 1;

        pic32mx_recalc_prios();
    }else if (pic32mx_nvic.InterruptPending[exception_no] == 1 && \
    pic32mx_nvic.InterruptEnabled[exception_no] == 1){
        pic32mx_recalc_prios();
    }
}


static void pic32mx_ExceptionEntry(uc_engine *uc) {  
    // interrupt trigger sends an IRQ too early and the actual enabling of interrupts hasn't been done.
    if (pic32mx_nvic.pending_irq == PIC32MX_NVIC_NONE_ACTIVE) return;

    #ifdef DEBUG_NVIC
    printf("[NVIC] ExceptionEntry\n"); fflush(stdout);
    #endif
    
