SaerTrial/Ext-fuzzware/emulator/harness/fuzzware_harness/native/core_peripherals/mips/pic32mx_nvic.c
    // Store the current PC in EPC
    uint32_t epc;
    uc_reg_read(uc, UC_MIPS_REG_PC, &epc);
    uc_reg_write(uc, UC_MIPS_REG_CP0_EPC, &epc);
    pic32mx_nvic.EPC = epc;

    // Find the ISR entry point and set it
    // EPC to return
    uint32_t ExceptionNumber =  PIC32MX_IRQ2VectorNum[pic32mx_nvic.pending_irq] ;

    //e.g., 0x9FC01000 + 0x200 + VecNum* 0x20
    uint32_t isr_entry = PIC32MX_EBASE + 0x200 + ExceptionNumber * 0x20;
   
    uc_reg_write(uc, UC_MIPS_REG_PC, &isr_entry);

    #ifdef DEBUG_NVIC
    printf("Redirecting irq %d (vector %d) to isr: %08x, EPC: %08x\n", pic32mx_nvic.pending_irq, ExceptionNumber, isr_entry, epc);
    #endif

    // Update pic32mx_nvic state with new active interrupt
    // pic32mx_nvic.InterruptPending[ExceptionNumber] = 0;
    // we clear pending bit in a MMIO write access to IFSxCLR
    
    //pic32mx_nvic.active_irq = ExceptionNumber;
    pic32mx_nvic.active_irq = pic32mx_nvic.pending_irq;

    // We need to re-calculate the pending priority state
    pic32mx_recalc_prios();

    #ifdef DEBUG_NVIC
    puts("************ POST ExceptionEntry");
    print_state(uc);
    #endif

}


uint16_t pic32mx_get_num_enabled() {
    return pic32mx_nvic.num_enabled;
}

uint8_t pic32mx_nth_enabled_irq_num(uint8_t n) {
    return pic32mx_nvic.enabled_irqs[n % pic32mx_nvic.num_enabled];
}

void pic32mx_nvic_set_pending(uc_engine *uc, uint32_t irq, int delay_activation) {
    pic32mx_pend_interrupt(uc, irq);
    // maybe_activate(uc, false);
}



void * pic32mx_nvic_take_snapshot(uc_engine *uc) {
    size_t size = sizeof(pic32mx_nvic);

    // NVIC snapshot: save the sysreg mem page
    char *result = malloc(size + PAGE_SIZE);
    memcpy(result, &pic32mx_nvic, size);
    uc_mem_read(uc, PIC32MX_INTR_CTL_REG_MMIO_BASE, result + size, PAGE_SIZE);

    return result;
}

void pic32mx_nvic_restore_snapshot(uc_engine *uc, void *snapshot) {
    // Restore the pic32mx_nvic
    memcpy(&pic32mx_nvic, snapshot, sizeof(pic32mx_nvic));
    // Restore the sysreg mem page
    uc_mem_write(uc, PIC32MX_INTR_CTL_REG_MMIO_BASE, ((char *) snapshot) + sizeof(pic32mx_nvic), PAGE_SIZE);
}

void pic32mx_nvic_discard_snapshot(uc_engine *uc, void *snapshot) {
    free(snapshot);
}



/*
 * Re-calculate pic32mx_nvic interrupt prios and determine the next interrupt
 * (i.e., a higher-prio interrupt is now pending)
 */
static bool pic32mx_recalc_prios() {
    int highest_pending_prio = PIC32MX_NVIC_LOWEST_PRIO;
    int highest_pending_sub_prio = PIC32MX_NVIC_LOWEST_PRIO;
    int highest_pending_irq = PIC32MX_NVIC_NONE_ACTIVE;
    

    // iterate all enabled and pending interrupts
    // sort the highest irq out
    // the active interrupt should be excluded
    for(int i = 0; i < pic32mx_nvic.num_enabled; ++i) {
        int irq = pic32mx_nvic.enabled_irqs[i];
        int curr_prio = pic32mx_nvic.InterruptPriority[irq];
        int curr_sub_prio = pic32mx_nvic.InterruptSubPriority[irq];
        
        #ifdef DEBUG_NVIC
           printf("[recalc_prios] irq:%d,  irq_prio:%d, irq_sub_prio:%d\n", irq, curr_prio, curr_sub_prio);
        #endif

        if(pic32mx_nvic.InterruptPending[irq] && pic32mx_nvic.active_irq != irq) {
            if (curr_prio > highest_pending_prio) {
                #ifdef DEBUG_NVIC
                printf("[recalc_prios] curr_prio > highest_pending_prio for irq %d: curr: %d > new highest: %d\n", irq, curr_prio, highest_pending_prio);
                #endif

                highest_pending_prio = curr_prio;
                highest_pending_sub_prio = curr_sub_prio;
                highest_pending_irq = irq;
            }
            else if (curr_prio == highest_pending_prio){
                // Further compare sub-priority
                if (curr_sub_prio > highest_pending_sub_prio) {

                    highest_pending_prio = curr_prio;
                    highest_pending_sub_prio = curr_sub_prio;
                    highest_pending_irq = irq;

                    #ifdef DEBUG_NVIC
                    printf("[recalc_prios] curr_sub_prio > highest_pending_sub_prio for irq %d: curr: %d > new highest: %d\n", irq, curr_sub_prio, highest_pending_sub_prio);
                    #endif
                }
            }
        }

        // TODO: consider the case for no active irq, and adjust highest pending one

    }


    pic32mx_nvic.pending_prio = highest_pending_prio;
    pic32mx_nvic.pending_sub_prio = highest_pending_sub_prio;
    pic32mx_nvic.pending_irq = highest_pending_irq;

    // no change
    if (highest_pending_irq == PIC32MX_NVIC_LOWEST_PRIO)
        return false;

    return true;
}



void pic32mx_update_enabled_irq_list(int irq){
    int i = 0;

    for(; i < pic32mx_nvic.num_enabled; ++i) {
        if(pic32mx_nvic.enabled_irqs[i] == irq) {
            return;
        }
    }

    i = 0;
    for(; i < pic32mx_nvic.num_enabled; ++i) {
        if(pic32mx_nvic.enabled_irqs[i] > irq) {
            memmove(&pic32mx_nvic.enabled_irqs[i+1], &pic32mx_nvic.enabled_irqs[i], (pic32mx_nvic.num_enabled-i) * sizeof(pic32mx_nvic.enabled_irqs[0]));
            break;
        }
    }

    pic32mx_nvic.enabled_irqs[i] = irq;
    ++pic32mx_nvic.num_enabled;

    #ifdef DEBUG_NVIC
    printf("[update_enabled_irq_list] \n");
    for(i=0; i < pic32mx_nvic.num_enabled; ++i) {
        printf("irq = %d\n", pic32mx_nvic.enabled_irqs[i]);
    }
    fflush(stdout);
    #endif

}


void pic32mx_update_enabled_interrupts(uc_engine *uc, uint32_t IEC_index, uint32_t value){
    int cur_bit = 0;
    int irq = 0;

    // Hack: we not only record enabled interrupts but also update their priority in pic32mx_nvic
    // in most cases, priority is defined before the interrupt is enabled

    while (cur_bit < 32){
        if (PIC32MX_Get_Bit(value, cur_bit) == 1){

            irq = IEC_index * 32 + cur_bit;

            if(pic32mx_is_disabled_by_config(irq)) break;
            
            pic32mx_nvic.InterruptEnabled[irq] = 1;

            pic32mx_update_enabled_irq_list(irq);


            break;
        }
        cur_bit ++;
    }

