SaerTrial/Ext-fuzzware/emulator/harness/fuzzware_harness/native/core_peripherals/mips/pic32mx_nvic.c
}


void pic32mx_update_pending_interrupts(uint32_t IFS_index, uint32_t value){
    int cur_bit = 0;
    int irq = 0;

    while (cur_bit < 32){
        if (PIC32MX_Get_Bit(value, cur_bit) == 1){
            irq = IFS_index * 32 + cur_bit;
            pic32mx_nvic.InterruptPending[irq] = 1;
            break;
        }

        cur_bit ++;
    }
}


void pic32mx_clear_interrupts(uint32_t IFSxCLR_index, uint32_t value){
    int cur_bit = 0;
    int irq = 0;
    while (cur_bit < 32){
        if (PIC32MX_Get_Bit(value, cur_bit) == 1){
            irq = IFSxCLR_index * 32 + cur_bit;
            pic32mx_nvic.InterruptPending[irq] = 0;

            // Hack: consider as an exception exit
            if (pic32mx_nvic.active_irq == irq) {
                pic32mx_nvic.active_irq = PIC32MX_NVIC_NONE_ACTIVE;
                    #ifdef DEBUG_NVIC
                    printf("[NVIC] setting irq %d as non-active \n", irq);
                    fflush(stdout);
                    #endif
                // check if any pending interrupts
                pic32mx_nesting_detector = pic32mx_recalc_prios();
            }
            break;
        }

        cur_bit ++;
    }
}


// FIXME: create a dict mapping a vector num to a list of IRQ
void pic32mx_update_enabled_interrupts_priority(uc_engine *uc, uint32_t offset, uint32_t priority){
        uint32_t index = ((offset & ~(0xf)) - PIC32MX_IPC0 )/ 0x10;
        int vector = index * 4; // FIXME: it is not an irq but a vector num
        int irq = 0;
        // update priority
        // priority, sub-priority

            // uc_mem_read(uc, PIC32MX_INTR_CTL_REG_MMIO_BASE + PIC32MX_IPC0 + index * 0x10 + PIC32MX_OFFSET_IPCxSET, &priority, 4);

        if (PIC32MX_Prio_0(priority) != 0){
            
            for (int i = 0; i < PIC32MX_MIRROR; i++){
                irq = PIC32MX_VectorNum2IRQ[vector][i];

                if(pic32mx_is_disabled_by_config(irq)) continue;
                
                pic32mx_nvic.InterruptEnabled[irq] = 1;

                pic32mx_update_enabled_irq_list(irq);

                pic32mx_nvic.InterruptPriority[irq] = PIC32MX_Prio_0(priority);
                pic32mx_nvic.InterruptSubPriority[irq] = PIC32MX_Sub_Prio_0(priority);
            }
        }
        else if(PIC32MX_Prio_1(priority) != 0){
            vector += 1;

            for (int i = 0; i < PIC32MX_MIRROR; i++){
                irq = PIC32MX_VectorNum2IRQ[vector][i];

                if(pic32mx_is_disabled_by_config(irq)) continue;
                
                pic32mx_nvic.InterruptEnabled[irq] = 1;

                pic32mx_update_enabled_irq_list(irq);

                pic32mx_nvic.InterruptPriority[irq] = PIC32MX_Prio_1(priority);
                pic32mx_nvic.InterruptSubPriority[irq] = PIC32MX_Sub_Prio_1(priority);
            }
        }
        else if (PIC32MX_Prio_2(priority) != 0){
            vector += 2;
            for (int i = 0; i < PIC32MX_MIRROR; i++){
                irq = PIC32MX_VectorNum2IRQ[vector][i];

                if(pic32mx_is_disabled_by_config(irq)) continue;
                
                pic32mx_nvic.InterruptEnabled[irq] = 1;

                pic32mx_update_enabled_irq_list(irq);
                pic32mx_nvic.InterruptPriority[irq] = PIC32MX_Prio_2(priority);
                pic32mx_nvic.InterruptSubPriority[irq] = PIC32MX_Sub_Prio_2(priority);
            }
        }
        else if (PIC32MX_Prio_3(priority) != 0){
            vector += 3;
            for (int i = 0; i < PIC32MX_MIRROR; i++){
                irq = PIC32MX_VectorNum2IRQ[vector][i];

                if(pic32mx_is_disabled_by_config(irq)) continue;
                
                pic32mx_nvic.InterruptEnabled[irq] = 1;

                pic32mx_update_enabled_irq_list(irq);

                pic32mx_nvic.InterruptPriority[irq] = PIC32MX_Prio_3(priority);
                pic32mx_nvic.InterruptSubPriority[irq] = PIC32MX_Sub_Prio_3(priority);
            }
        }
            
        #ifdef DEBUG_NVIC
            printf("[update interrupt priority] irq = %d, priority = %d, sub-priority = %d\n", irq, pic32mx_nvic.InterruptPriority[irq], pic32mx_nvic.InterruptSubPriority[irq]);
            fflush(stdout);
        #endif
    
} 

// due to some application codes that utilze peripheral control registers to enable/disable interrupts along the way
// we need to detect this behavior
void pic32mx_hook_peripheral_ctl_mmio_write(uc_engine *uc, uc_mem_type type,
                        uint64_t addr, int size, int64_t value, void *user_data) {
    #ifdef DEBUG_NVIC
    printf("[NVIC] hook_peripheral_ctl_mmio_write: Write to %08lx, value: %08lx\n", addr, value);
    fflush(stdout);
    #endif     

    // Caution: since we've only noticed that timer is disabled/enabled in running, we thus monitor all timers.
    // TODO: optimize this switch case
    switch(addr) {  
        case PIC32MX_T1CON + PIC32MX_OFFSET_xSET:
            pic32mx_nvic.InterruptPending[PIC32MX_TIMER_1_VECTOR] = 1;
            break;
        case PIC32MX_T1CON + PIC32MX_OFFSET_xCLR:
            pic32mx_nvic.InterruptPending[PIC32MX_TIMER_1_VECTOR] = 0;
            break;             
        case PIC32MX_T2CON + PIC32MX_OFFSET_xSET:
            pic32mx_nvic.InterruptPending[PIC32MX_TIMER_2_VECTOR] = 1;
            break;
        case PIC32MX_T2CON + PIC32MX_OFFSET_xCLR:
            pic32mx_nvic.InterruptPending[PIC32MX_TIMER_2_VECTOR] = 0;
            break;            
        case PIC32MX_T3CON + PIC32MX_OFFSET_xSET:
            pic32mx_nvic.InterruptPending[PIC32MX_TIMER_3_VECTOR] = 1;
            break;            
        case PIC32MX_T3CON + PIC32MX_OFFSET_xCLR:
            pic32mx_nvic.InterruptPending[PIC32MX_TIMER_3_VECTOR] = 0;
            break;  
        case PIC32MX_T4CON + PIC32MX_OFFSET_xSET:
            pic32mx_nvic.InterruptPending[PIC32MX_TIMER_4_VECTOR] = 1;
            break; 
        case PIC32MX_T4CON + PIC32MX_OFFSET_xCLR:
            pic32mx_nvic.InterruptPending[PIC32MX_TIMER_4_VECTOR] = 0;
            break; 
        case PIC32MX_T5CON + PIC32MX_OFFSET_xSET:
            pic32mx_nvic.InterruptPending[PIC32MX_TIMER_5_VECTOR] = 1;
            break;   
        case PIC32MX_T5CON + PIC32MX_OFFSET_xCLR:
            pic32mx_nvic.InterruptPending[PIC32MX_TIMER_5_VECTOR] = 0;
            break;  
        default: break;
    }


