SaerTrial/Ext-fuzzware/emulator/harness/fuzzware_harness/native/core_peripherals/mips/pic32mx_nvic.c
}


void pic32mx_hook_sysctl_mmio_write(uc_engine *uc, uc_mem_type type,
                        uint64_t addr, int size, int64_t value, void *user_data) {
    #ifdef DEBUG_NVIC
    printf("[NVIC] hook_sysctl_mmio_write: Write to %08lx, value: %08lx\n", addr, value);
    fflush(stdout);
    #endif                     
    

    // identify which interrupt control register to be written
    // uint32_t offset = addr & 0xFFF;

    switch(addr) {     
        // interrupt flags
        case PIC32MX_IFS0:
            pic32mx_update_pending_interrupts(0, value);
            break;
        case PIC32MX_IFS1:
            pic32mx_update_pending_interrupts(1, value);
            break;
        case PIC32MX_IFS2:
            pic32mx_update_pending_interrupts(2, value);
            break;


        // interrupt mask
        // Hack: once a write to the below registers corresponding to 
        // we then iterate enabled interrupts through this register, each register records 32 IRQ
        case PIC32MX_IEC0:
            pic32mx_update_enabled_interrupts(uc, 0, value);
            break;
        case PIC32MX_IEC1:
            pic32mx_update_enabled_interrupts(uc, 1, value);
            break;
        case PIC32MX_IEC2:
            pic32mx_update_enabled_interrupts(uc, 2, value);
            break;

        // enable an interrupt
        // same as above, but some system code utilizes this register
        case PIC32MX_IEC0SET:
            pic32mx_update_enabled_interrupts(uc, 0, value);
            break;
        case PIC32MX_IEC1SET:
            pic32mx_update_enabled_interrupts(uc, 1, value);
            break;
        case PIC32MX_IEC2SET:
            pic32mx_update_enabled_interrupts(uc, 2, value);
            break;

        // interrupt CLR register at the offset of 4 bytes in the associated register, e.g., IFS0CLR
        // crucial to terminate an ISR by setting as non-active
        case PIC32MX_IFS0CLR:
            pic32mx_clear_interrupts(0, value);
            break;
        case PIC32MX_IFS1CLR:
            pic32mx_clear_interrupts(1, value);
            break;
        case PIC32MX_IFS2CLR:
            pic32mx_clear_interrupts(2, value);
            break;
        case PIC32MX_IPC0SET ... PIC32MX_IPC12SET:
            // interrupt priority
            pic32mx_update_enabled_interrupts_priority(uc, addr, value);
            break;

        default: break;
    }

}






bool pic32mx_is_disabled_by_config(int exception_no) {
    for(int i = 0; i < pic32mx_num_config_disabled_interrupts; ++i) {
        if(pic32mx_config_disabled_interrupts[i] == exception_no) {
            return true;
        }
    }

    return false;
}

void pic32mx_init_irq2vector(){
    int index = 0;
    // first ordered tier
    for (; index <= 23; index++){
        PIC32MX_IRQ2VectorNum[index] = index;
        for (int j = 0; j < PIC32MX_MIRROR; j++){
            PIC32MX_VectorNum2IRQ[index][j] = index;
        }
    }


    // unordered
    PIC32MX_IRQ2VectorNum[index] = 23; index++; // irq 24 -> vector 23
    PIC32MX_IRQ2VectorNum[index] = 23; index++; // irq 25 -> vector 23

    PIC32MX_VectorNum2IRQ[23][0] = 23;
    PIC32MX_VectorNum2IRQ[23][1] = 24;
    PIC32MX_VectorNum2IRQ[23][2] = 25;

    PIC32MX_IRQ2VectorNum[index] = 24; index++; // irq 26 -> vector 24
    PIC32MX_IRQ2VectorNum[index] = 24; index++; // irq 27 -> vector 24
    PIC32MX_IRQ2VectorNum[index] = 24; index++; // irq 28 -> vector 24

    PIC32MX_VectorNum2IRQ[24][0] = 26;
    PIC32MX_VectorNum2IRQ[24][1] = 27;
    PIC32MX_VectorNum2IRQ[24][2] = 28;

    PIC32MX_IRQ2VectorNum[index] = 25; index++; // irq 29 -> vector 25
    PIC32MX_IRQ2VectorNum[index] = 25; index++; // irq 30 -> vector 25
    PIC32MX_IRQ2VectorNum[index] = 25; index++; // irq 31 -> vector 25

    PIC32MX_VectorNum2IRQ[25][0] = 29;
    PIC32MX_VectorNum2IRQ[25][1] = 30;
    PIC32MX_VectorNum2IRQ[25][2] = 31;


    PIC32MX_IRQ2VectorNum[index] = 26; index++; // irq 32 -> vector 26
    PIC32MX_IRQ2VectorNum[index] = 27; index++; // irq 33 -> vector 27
    PIC32MX_IRQ2VectorNum[index] = 28; index++; // irq 34 -> vector 28    
    PIC32MX_IRQ2VectorNum[index] = 29; index++; // irq 35 -> vector 29
    PIC32MX_IRQ2VectorNum[index] = 30; index++; // irq 36 -> vector 30

    PIC32MX_VectorNum2IRQ[26][0] = 32; PIC32MX_VectorNum2IRQ[26][1] = 32; PIC32MX_VectorNum2IRQ[26][2] = 32; 
    PIC32MX_VectorNum2IRQ[27][0] = 33; PIC32MX_VectorNum2IRQ[27][1] = 33; PIC32MX_VectorNum2IRQ[27][2] = 33; 
    PIC32MX_VectorNum2IRQ[28][0] = 34; PIC32MX_VectorNum2IRQ[28][1] = 34; PIC32MX_VectorNum2IRQ[28][2] = 34; 
    PIC32MX_VectorNum2IRQ[29][0] = 35; PIC32MX_VectorNum2IRQ[29][1] = 35; PIC32MX_VectorNum2IRQ[29][2] = 35; 
    PIC32MX_VectorNum2IRQ[30][0] = 36; PIC32MX_VectorNum2IRQ[30][1] = 36; PIC32MX_VectorNum2IRQ[30][2] = 36; 

    PIC32MX_IRQ2VectorNum[index] = 31; index++; // irq 37 -> vector 31
    PIC32MX_IRQ2VectorNum[index] = 31; index++; // irq 38 -> vector 31   
    PIC32MX_IRQ2VectorNum[index] = 31; index++; // irq 39 -> vector 31

    PIC32MX_VectorNum2IRQ[31][0] = 37; 
    PIC32MX_VectorNum2IRQ[31][1] = 38; 
    PIC32MX_VectorNum2IRQ[31][2] = 39; 

    PIC32MX_IRQ2VectorNum[index] = 32; index++; // irq 40 -> vector 32
    PIC32MX_IRQ2VectorNum[index] = 32; index++; // irq 41 -> vector 32   
    PIC32MX_IRQ2VectorNum[index] = 32; index++; // irq 42 -> vector 32

    PIC32MX_VectorNum2IRQ[32][0] = 40; 
    PIC32MX_VectorNum2IRQ[32][1] = 41; 
    PIC32MX_VectorNum2IRQ[32][2] = 42; 


    PIC32MX_IRQ2VectorNum[index] = 33; index++; // irq 43 -> vector 33
    PIC32MX_IRQ2VectorNum[index] = 33; index++; // irq 44 -> vector 33   
    PIC32MX_IRQ2VectorNum[index] = 33; index++; // irq 45 -> vector 33

    PIC32MX_VectorNum2IRQ[33][0] = 43; 
    PIC32MX_VectorNum2IRQ[33][1] = 44; 
    PIC32MX_VectorNum2IRQ[33][2] = 45; 

    PIC32MX_IRQ2VectorNum[index] = 34; index++; // irq 46 -> vector 34
    PIC32MX_IRQ2VectorNum[index] = 35; index++; // irq 47 -> vector 35   
    PIC32MX_IRQ2VectorNum[index] = 36; index++; // irq 48 -> vector 36
    PIC32MX_IRQ2VectorNum[index] = 37; index++; // irq 49 -> vector 37
    PIC32MX_IRQ2VectorNum[index] = 38; index++; // irq 50 -> vector 38   
    PIC32MX_IRQ2VectorNum[index] = 39; index++; // irq 51 -> vector 39

