SaerTrial/Ext-fuzzware/emulator/harness/fuzzware_harness/native/core_peripherals/mips/pic32mx_nvic.c
    PIC32MX_VectorNum2IRQ[34][0] = 46; PIC32MX_VectorNum2IRQ[34][1] = 46; PIC32MX_VectorNum2IRQ[34][2] = 46; 
    PIC32MX_VectorNum2IRQ[35][0] = 47; PIC32MX_VectorNum2IRQ[35][1] = 47; PIC32MX_VectorNum2IRQ[35][2] = 47; 
    PIC32MX_VectorNum2IRQ[36][0] = 48; PIC32MX_VectorNum2IRQ[36][1] = 48; PIC32MX_VectorNum2IRQ[36][2] = 48; 
    PIC32MX_VectorNum2IRQ[37][0] = 49; PIC32MX_VectorNum2IRQ[37][1] = 49; PIC32MX_VectorNum2IRQ[37][2] = 49; 
    PIC32MX_VectorNum2IRQ[38][0] = 50; PIC32MX_VectorNum2IRQ[38][1] = 50; PIC32MX_VectorNum2IRQ[38][2] = 50; 
    PIC32MX_VectorNum2IRQ[39][0] = 51; PIC32MX_VectorNum2IRQ[39][1] = 51; PIC32MX_VectorNum2IRQ[39][2] = 51; 

}


uc_err pic32mx_init_nvic(uc_engine *uc, uint32_t vtor, uint32_t num_irq, uint32_t p_interrupt_limit, uint32_t num_disabled_interrupts, uint32_t *disabled_interrupts) {
    #ifdef DEBUG_NVIC
    printf("[NVIC] init_nvic called with vtor: %x, num_irq: %d\n", vtor, num_irq); fflush(stdout);
    #endif

    if(num_irq > PIC32MX_NVIC_NUM_SUPPORTED_INTERRUPTS) {
        num_irq = PIC32MX_NVIC_NUM_SUPPORTED_INTERRUPTS;
    }

    pic32mx_init_irq2vector();
    pic32mx_nvic.active_irq = PIC32MX_NVIC_NONE_ACTIVE;
    pic32mx_nvic.pending_irq = PIC32MX_NVIC_NONE_ACTIVE;
    pic32mx_nvic.pending_sub_prio = PIC32MX_NVIC_LOWEST_PRIO;
    pic32mx_nvic.pending_prio = PIC32MX_NVIC_LOWEST_PRIO;

    pic32mx_nvic.interrupt_count = 0;
    pic32mx_interrupt_limit = p_interrupt_limit;
    pic32mx_num_config_disabled_interrupts = num_disabled_interrupts;

    pic32mx_config_disabled_interrupts = calloc(num_disabled_interrupts, sizeof(*disabled_interrupts));

    for(uint32_t i = 0; i < num_disabled_interrupts; ++i)
        // save disabled IRQs
        pic32mx_config_disabled_interrupts[i] = disabled_interrupts[i];
    

    uc_hook_add(uc, &pic32mx_nvic_block_hook_handle, UC_HOOK_BLOCK_UNCONDITIONAL, pic32mx_nvic_block_hook, &pic32mx_nvic, 1, 0);
    
    // pic32mx_nvic MMIO range write handler to update status
    uc_hook_add(uc, &pic32mx_hook_mmio_write_handle, UC_HOOK_MEM_WRITE, pic32mx_hook_sysctl_mmio_write, NULL, PIC32MX_INTR_CTL_REG_MMIO_BASE, PIC32MX_INTR_CTL_REG_MMIO_END);
    // uc_hook_add(uc, &pic32mx_hook_mmio_read_handle, UC_HOOK_MEM_READ, pic32mx_hook_sysctl_mmio_read, NULL, PIC32MX_INTR_CTL_REG_MMIO_BASE, PIC32MX_INTR_CTL_REG_MMIO_END);

    uc_hook_add(uc, &pic32mx_hook_mmio_write_handle, UC_HOOK_MEM_WRITE, pic32mx_hook_peripheral_ctl_mmio_write, NULL, PIC32MX_PERIPHERAL_CTL_MMIO_BASE, PIC32MX_PERIPHERAL_CTL_MMIO_END);



    subscribe_state_snapshotting(uc, pic32mx_nvic_take_snapshot, pic32mx_nvic_restore_snapshot, pic32mx_nvic_discard_snapshot);

    return UC_ERR_OK;
}